Repository: Xippo/OM-Cookie-Manager
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_omcookiemanager_domain_model_cookie.description
source: Description
de: Beschreibung

# tx_omcookiemanager_domain_model_cookie.lifetime
source: Lifetime
de: Speicherdauer

# tx_omcookiemanager_domain_model_cookie.cookie_group
source: Cookie Group
de: Cookie Gruppe

# tx_omcookiemanager_domain_model_cookiegroup
source: Cookie Group
de: Cookie Gruppe

# tx_omcookiemanager_domain_model_cookiegroup.description
source: Description
de: Beschreibung

# tx_omcookiemanager_domain_model_cookiegroup.essential
source: Essential (the option will be shown as checked and greyed out. The scripts will be loaded always after the save)
de: Essentiell (Die Gruppe wird im Optin schon angewählt und ausgegraut angezeigt. Das HTML und die hinterlegten Script Tags werden nach dem Speichern immer hinzugefügt und ausgeführt)

# tx_omcookiemanager_domain_model_cookiepanel.name
source: Name (the header of the cookie optin panel)
de: Titel (wird als überschrift vom optin panel verwendet)

# tx_omcookiemanager_domain_model_cookiepanel.description
source: Description (this is shown in the information table/view)
de: Beschreibung (wird in der Informationstabelle angezeigt)

# tx_omcookiemanager_domain_model_cookiepanel.link
source: Link to the legal notice
de: Link zum Impressum

# tx_omcookiemanager_domain_model_cookiepanel.link
source: Alternative link text for legal notice link
de: Alternativer Linktext für den Impressum Link

# tx_omcookiemanager_domain_model_cookiepanel.link
source: Link to cookie or privacy policy, will be shown on the panel
de: Link zur Datenschutzseite oder Cookie policy (Der Link wird im Optin Panel zur Verfügung gestellt)

# tx_omcookiemanager_domain_model_cookiepanel.link
source: Alternative link text for the cookie or privacy policy link
de: Alternativer Linktext für den Link zur Datenschutzseite

# tx_omcookiemanager_domain_model_cookiepanel.groups
source: Active groups and there ordering
de: Aktive Gruppen und deren Anordnung

# tx_omcookiemanager_domain_model_cookiegroup.gtm_groups
source: Google Consent Mode v2 - Categories
de: Google Consent Mode v2 - Kategorien

# tx_omcookiemanager_domain_model_cookiehtml.html
source: HTML
de: HTML (fügen Sie hier bitte ihre Script tags rein. Bitte kein JS ohne script tag verwenden)

# tx_omcookiemanager_domain_model_cookiehtml.insert_place
source: Insert in
de: Einfügen in

# tx_om_cookie_manager_main.name
source: OM Cookie Manager - Information Table/View
de: OM Cookie Manager - Cookie Informationstabelle

# tx_om_cookie_manager_main.description
source: This plugin generates a overview about all cookie groups and cookies with there descriptions (the data comes from the records). There is as well a link, that offers the possibility to open the Cookie Panel and modify settings
de: Dieses Plugin generiert eine Cookie Informationstabelle wo alle Gruppen und deren Cookies samt beschreibung gelistet werden. Die Daten werden aus den Datensätzen gelesen. Hier wird auch ein Link zu Verfügung gestellt der es ermöglicht den Optin panel wieder zu öffnen und Einstellungen zu verändern

# tx_omcookiemanager_domain_model_cookiegroup.description
source: Google Tag Manager event name (this will be pushed in the dataLayer when the group is accepted in the optin)
de: Google Tag Manager event name (dieses Event wird in den dataLayer gepusht, wenn die Gruppe akzeptiert wurde. Kann im GTM somit als Trigger dienen)
